In [1]:
import pandas as pd

### Connect Pandas to the database with this URL:

In [2]:
 cast = pd.read_csv('data/cast.csv', index_col=None)
 cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [3]:
 release_dates = pd.read_csv('data/release_dates.csv', index_col=None,
                                       parse_dates=['date'], infer_datetime_format=True)
 release_dates.head()

                    title  year      country       date
0   #73, Shaanthi Nivaasa  2007        India 2007-06-15
1                 #Beings  2015      Romania 2015-01-29
2               #Declimax  2018  Netherlands 2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines 2015-01-21
4                 #Horror  2015          USA 2015-11-20

In [4]:
release_dates.dtypes

title              object
year                int64
country            object
date       datetime64[ns]
dtype: object

### Count the number of months in which movies with "Christmas" in their title tend to be released in the USA.

In [5]:
df = release_dates[(release_dates["title"].str.contains("Christmas", case = False, regex = False)) & (release_dates["country"] == "USA")]
df.head()

                                         title  year country       date
1191                  12 Dog Days of Christmas  2014     USA 2014-11-28
1192  12 Dogs of Christmas: Great Puppy Rescue  2012     USA 2012-10-09
5904                     A Belle for Christmas  2014     USA 2014-11-04
6163                       A Cadaver Christmas  2011     USA 2011-04-02
6272                         A Christmas Carol  1938     USA 1938-12-16

In [6]:
df["month"] = df["date"].dt.month
df.head()

<ipython-input-6-a9e6984fb23c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["month"] = df["date"].dt.month

                                         title  year country       date  month
1191                  12 Dog Days of Christmas  2014     USA 2014-11-28     11
1192  12 Dogs of Christmas: Great Puppy Rescue  2012     USA 2012-10-09     10
5904                     A Belle for Christmas  2014     USA 2014-11-04     11
6163                       A Cadaver Christmas  2011     USA 2011-04-02      4
6272                         A Christmas Carol  1938     USA 1938-12-16     12

In [27]:
df.groupby("month").size()

month
1      2
2      2
4      1
5      1
6      1
7      1
8      2
9      2
10    14
11    38
12    47
dtype: int64

In [7]:
len(df.groupby("month"))

11

### Count the number of months in which movies with "Christmas" in their title tend to be released in Canada.

In [9]:
df_1 = release_dates[(release_dates["title"].str.contains("Christmas", case = False, regex = False)) & (release_dates["country"] == "Canada")]
df_1.head()

                                    title  year country       date
6283                    A Christmas Carol  2009  Canada 2009-11-06
6347                    A Christmas Story  1983  Canada 1983-11-18
8555           A Merry Friggin' Christmas  2014  Canada 2014-11-22
10040             A Snow Capped Christmas  2016  Canada 2016-12-15
10743  A Very Harold & Kumar 3D Christmas  2011  Canada 2011-11-04

In [10]:
df_1["month"] = df_1["date"].dt.month
df_1.head()

<ipython-input-10-d94531f876dd>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_1["month"] = df_1["date"].dt.month

                                    title  year country       date  month
6283                    A Christmas Carol  2009  Canada 2009-11-06     11
6347                    A Christmas Story  1983  Canada 1983-11-18     11
8555           A Merry Friggin' Christmas  2014  Canada 2014-11-22     11
10040             A Snow Capped Christmas  2016  Canada 2016-12-15     12
10743  A Very Harold & Kumar 3D Christmas  2011  Canada 2011-11-04     11

In [12]:
df_1.groupby("month").size()

month
10    2
11    9
12    6
dtype: int64

In [11]:
len(df_1.groupby("month"))

3

### Count the number of months in which movies whose titles start with "The Hobbit" are released in the USA.

In [14]:
df_2 = release_dates[(release_dates["title"].str.startswith("The Hobbit")) & (release_dates["country"] == "USA")]
df_2.head()

                                            title  year country       date
366876          The Hobbit: An Unexpected Journey  2012     USA 2012-12-14
366941  The Hobbit: The Battle of the Five Armies  2014     USA 2014-12-17
367011        The Hobbit: The Desolation of Smaug  2013     USA 2013-12-13

In [15]:
df_2["month"] = df_2["date"].dt.month
df_2.head()

<ipython-input-15-d8ced8e0875b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_2["month"] = df_2["date"].dt.month

,title,year,country,date,month
366876,The Hobbit: An Unexpected Journey,2012,USA,2012-12-14,12
366941,The Hobbit: The Battle of the Five Armies,2014,USA,2014-12-17,12
367011,The Hobbit: The Desolation of Smaug,2013,USA,2013-12-13,12

In [16]:
df_2.groupby("month").size()

month
12    3
dtype: int64

In [17]:
len(df_2.groupby("month"))

1

### Count day of the week on which movies with "Romance" in their title tend to be released in the USA.

In [19]:
df_3 = release_dates[(release_dates["title"].str.contains("Romance", case = False, regex = False)) & (release_dates["country"] == "USA")]
df_3.head()

                                  title  year country       date
913   100% OFF: A Recession-Era Romance  2012     USA 2012-07-04
6171               A California Romance  1922     USA 1922-12-24
6408                   A Circus Romance  1916     USA 1916-01-24
6539                  A Crooked Romance  1917     USA 1917-09-30
6550               A Cumberland Romance  1920     USA 1920-08-06

In [20]:
df_3["day of the week"] = df_3["date"].dt.dayofweek
df_3.head()

<ipython-input-20-f7c0399f7746>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_3["day of the week"] = df_3["date"].dt.dayofweek

,title,year,country,date,day of the week
913,100% OFF: A Recession-Era Romance,2012,USA,2012-07-04,2
6171,A California Romance,1922,USA,1922-12-24,6
6408,A Circus Romance,1916,USA,1916-01-24,0
6539,A Crooked Romance,1917,USA,1917-09-30,6
6550,A Cumberland Romance,1920,USA,1920-08-06,4

In [21]:
df_3.groupby("day of the week").size()

day of the week
0    21
1     4
2    11
3     6
4    19
5     9
6    32
dtype: int64

In [22]:
len(df_3.groupby("day of the week"))

7

### Count day of the week on which movies with "Action" in their title tend to be released in the USA.

In [23]:
df_4 = release_dates[(release_dates["title"].str.contains("Action", case = False, regex = False)) & (release_dates["country"] == "USA")]
df_4.head()

                 title  year country       date
6411    A Civil Action  1998     USA 1999-01-08
8462   A Man of Action  1923     USA 1923-06-03
13176    Ace of Action  1926     USA 1926-11-28
13441           Action  1921     USA 1921-09-12
13447    Action Galore  1925     USA 1925-11-03

In [24]:
df_4["day of the week"] = df_4["date"].dt.dayofweek
df_4.head()

<ipython-input-24-2549d51d56e1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_4["day of the week"] = df_4["date"].dt.dayofweek

                 title  year country       date  day of the week
6411    A Civil Action  1998     USA 1999-01-08                4
8462   A Man of Action  1923     USA 1923-06-03                6
13176    Ace of Action  1926     USA 1926-11-28                6
13441           Action  1921     USA 1921-09-12                0
13447    Action Galore  1925     USA 1925-11-03                1

In [25]:
df_4.groupby("day of the week").size()

day of the week
0     2
1     1
2     3
3     3
4    28
5     3
6     3
dtype: int64

In [26]:
len(df_4.groupby("day of the week"))

7

### On which date was each Judi Dench movie from the 1990s released in the USA?

In [28]:
cast_dates = pd.merge(cast, release_dates, on = ['title', 'year'], how = 'outer')
cast_dates.head()

,title,year,name,type,character,n,country,date
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,Taiwan,2016-05-27
1,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,Germany,2016-10-06
2,Closet Monster,2015,Aaron Abrams,actor,Peter Madly,3.0,Taiwan,2016-05-27
3,Closet Monster,2015,Aaron Abrams,actor,Peter Madly,3.0,Germany,2016-10-06
4,Closet Monster,2015,Chunk (III),actor,Buffy 1,NaN,Taiwan,2016-05-27

In [29]:
release_dates[release_dates["title"] == "Closet Monster"]

                title  year  country       date
68333  Closet Monster  2015   Taiwan 2016-05-27
68334  Closet Monster  2015  Germany 2016-10-06

In [37]:
df_5 = cast_dates[(cast_dates["year"] >= 1990) & (cast_dates["year"] <= 1999) 
                      & (cast_dates["name"] == "Judi Dench") & (cast_dates["country"] == "USA")]
df_5.head()

,title,year,name,type,character,n,country,date
515505,Hamlet,1996,Judi Dench,actress,Hecuba,12.0,USA,1996-12-25
1504781,Tea with Mussolini,1999,Judi Dench,actress,Arabella,2.0,USA,1999-05-14
4866318,Shakespeare in Love,1998,Judi Dench,actress,Queen Elizabeth,12.0,USA,1999-01-08
6859941,The World Is Not Enough,1999,Judi Dench,actress,M,6.0,USA,1999-11-19
7779164,Tomorrow Never Dies,1997,Judi Dench,actress,M,9.0,USA,1997-12-19

In [38]:
df_5

,title,year,name,type,character,n,country,date
515505,Hamlet,1996,Judi Dench,actress,Hecuba,12.0,USA,1996-12-25
1504781,Tea with Mussolini,1999,Judi Dench,actress,Arabella,2.0,USA,1999-05-14
4866318,Shakespeare in Love,1998,Judi Dench,actress,Queen Elizabeth,12.0,USA,1999-01-08
6859941,The World Is Not Enough,1999,Judi Dench,actress,M,6.0,USA,1999-11-19
7779164,Tomorrow Never Dies,1997,Judi Dench,actress,M,9.0,USA,1997-12-19
15007690,GoldenEye,1995,Judi Dench,actress,M,6.0,USA,1995-11-17
15433048,Jack & Sarah,1995,Judi Dench,actress,Margaret,3.0,USA,1996-03-22
18359798,Mrs Brown,1997,Judi Dench,actress,Queen Victoria,1.0,USA,1997-10-03

In [39]:
df_5[['year', 'title', 'date']].sort_values('date')

          year                    title       date
15007690  1995                GoldenEye 1995-11-17
15433048  1995             Jack & Sarah 1996-03-22
515505    1996                   Hamlet 1996-12-25
18359798  1997                Mrs Brown 1997-10-03
7779164   1997      Tomorrow Never Dies 1997-12-19
4866318   1998      Shakespeare in Love 1999-01-08
1504781   1999       Tea with Mussolini 1999-05-14
6859941   1999  The World Is Not Enough 1999-11-19

### In which months do films with Judi Dench tend to be released in the USA?

In [41]:
df_6 = cast_dates[(cast_dates["name"] == "Judi Dench") & (cast_dates["country"] == "USA")]
df_6.head()

,title,year,name,type,character,n,country,date
389989,Spectre,2015,Judi Dench,actress,M,NaN,USA,2015-11-06
493789,Tulip Fever,2017,Judi Dench,actress,The Abbess of St. Ursula,NaN,USA,2017-02-24
515505,Hamlet,1996,Judi Dench,actress,Hecuba,12.0,USA,1996-12-25
1504781,Tea with Mussolini,1999,Judi Dench,actress,Arabella,2.0,USA,1999-05-14
1597315,Casino Royale,2006,Judi Dench,actress,M,4.0,USA,2006-11-17

In [42]:
df_6["month"] = df_6["date"].dt.month
df_6.head()

<ipython-input-42-d34bedefcb29>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_6["month"] = df_6["date"].dt.month

,title,year,name,type,character,n,country,date,month
389989,Spectre,2015,Judi Dench,actress,M,NaN,USA,2015-11-06,11
493789,Tulip Fever,2017,Judi Dench,actress,The Abbess of St. Ursula,NaN,USA,2017-02-24,2
515505,Hamlet,1996,Judi Dench,actress,Hecuba,12.0,USA,1996-12-25,12
1504781,Tea with Mussolini,1999,Judi Dench,actress,Arabella,2.0,USA,1999-05-14,5
1597315,Casino Royale,2006,Judi Dench,actress,M,4.0,USA,2006-11-17,11

In [48]:
df_6.groupby("month").size()

month
1      4
2      4
3      3
4      2
5      4
6      3
7      1
8      1
9      2
10     1
11    12
12     4
dtype: int64

In [47]:
df_6.groupby("month").groups.keys()

dict_keys([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12])

### In which months do films with Tom Cruise tend to be released in the USA?

In [49]:
df_7 = cast_dates[(cast_dates["name"] == "Tom Cruise") & (cast_dates["country"] == "USA")]
df_7.head()

,title,year,name,type,character,n,country,date
285764,Mission: Impossible - Rogue Nation,2015,Tom Cruise,actor,Ethan Hunt,1.0,USA,2015-07-31
753323,Born on the Fourth of July,1989,Tom Cruise,actor,Ron Kovic,1.0,USA,1990-01-05
756656,Cocktail,1988,Tom Cruise,actor,Brian Flanagan,1.0,USA,1988-07-29
1414144,Tropic Thunder,2008,Tom Cruise,actor,Les Grossman - Grossman's Office,36.0,USA,2008-08-13
3290444,Austin Powers in Goldmember,2002,Tom Cruise,actor,Tom Cruise,81.0,USA,2002-07-26

In [50]:
df_7["month"] = df_7["date"].dt.month
df_7.head()

<ipython-input-50-56edf110ad37>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_7["month"] = df_7["date"].dt.month

,title,year,name,type,character,n,country,date,month
285764,Mission: Impossible - Rogue Nation,2015,Tom Cruise,actor,Ethan Hunt,1.0,USA,2015-07-31,7
753323,Born on the Fourth of July,1989,Tom Cruise,actor,Ron Kovic,1.0,USA,1990-01-05,1
756656,Cocktail,1988,Tom Cruise,actor,Brian Flanagan,1.0,USA,1988-07-29,7
1414144,Tropic Thunder,2008,Tom Cruise,actor,Les Grossman - Grossman's Office,36.0,USA,2008-08-13,8
3290444,Austin Powers in Goldmember,2002,Tom Cruise,actor,Tom Cruise,81.0,USA,2002-07-26,7

In [51]:
df_7.groupby("month").size()

month
1      2
3      1
4      3
5      5
6      8
7      7
8      3
9      1
10     3
11     3
12    10
dtype: int64

In [52]:
df_7.groupby("month").groups.keys()

dict_keys([1, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12])